# **<u>DBMS Experiment 9</u>**

In [1]:
CREATE DATABASE CS210Exp9;

In [2]:
USE CS210Exp6;

In [3]:
-- Create the employees table
CREATE TABLE employees (
    employee_id INT PRIMARY KEY,
    name VARCHAR(50),
    salary DECIMAL(10,2),
    department_id INT
);

-- Insert sample employees
INSERT INTO employees (employee_id, name, salary, department_id) VALUES
(1, 'Rohan Kumar', 50000.00, 101),
(2, 'Priya Sharma', 60000.00, 102),
(3, 'Amit Patel', 45000.00, 101),
(4, 'Sneha Desai', 70000.00, 103),
(5, 'Rahul Singh', 55000.00, 102);

-- Create the departments table
CREATE TABLE departments (
    department_id INT PRIMARY KEY,
    department_name VARCHAR(50),
    location VARCHAR(50)
);

-- Insert sample departments
INSERT INTO departments (department_id, department_name, location) VALUES
(101, 'Finance', 'Mumbai'),
(102, 'HR', 'Delhi'),
(103, 'IT', 'Bengaluru');

-- Create the sales table
CREATE TABLE sales (
    sale_id INT PRIMARY KEY,
    employee_id INT,
    sales_amount DECIMAL(10,2),
    sale_date DATE
);

-- Insert sample sales records
INSERT INTO sales (sale_id, employee_id, sales_amount, sale_date) VALUES
(1, 1, 10000.00, '2025-03-01'),
(2, 2, 15000.00, '2025-03-02'),
(3, 1, 8000.00, '2025-03-05'),
(4, 3, 12000.00, '2025-03-06'),
(5, 4, 20000.00, '2025-03-07');

-- Create the managers table
CREATE TABLE managers (
    manager_id INT PRIMARY KEY,
    name VARCHAR(50),
    salary DECIMAL(10,2)
);

-- Insert sample managers 
INSERT INTO managers (manager_id, name, salary) VALUES
(101, 'Suresh Rao', 80000.00),
(102, 'Neha Gupta', 90000.00);

## Subquery Basics

In [4]:
SELECT employee_id, name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees);

employee_id,name,salary
2,Priya Sharma,60000.00
4,Sneha Desai,70000.00

## Subqueries in Conditional Logic

In [5]:
SELECT employee_id, name, department_id
FROM employees
WHERE department_id IN (
    SELECT department_id
    FROM departments
    WHERE location = 'Delhi'
);

employee_id,name,department_id
2,Priya Sharma,102
5,Rahul Singh,102

## Joining Subqueries

In [6]:
SELECT e.employee_id, e.name, s.total_sales
FROM employees e
JOIN (
    SELECT employee_id, SUM(sales_amount) AS total_sales
    FROM sales
    GROUP BY employee_id
) s ON e.employee_id = s.employee_id;

employee_id,name,total_sales
1,Rohan Kumar,18000.00
2,Priya Sharma,15000.00
3,Amit Patel,12000.00
4,Sneha Desai,20000.00

## Subqueries and UNIONs

In [7]:
SELECT employee_id AS id, name, salary
FROM employees
WHERE salary > (SELECT AVG(salary) FROM employees)
UNION
SELECT manager_id AS id, name, salary
FROM managers
WHERE salary > (SELECT AVG(salary) FROM managers);

id,name,salary
2,Priya Sharma,60000.00
4,Sneha Desai,70000.00
102,Neha Gupta,90000.00